wikimedia/smash-pig/PaymentProviders/Adyen/Tests/Data/auth.json

{
  "paymentMethod": "amex",
  "operations": [
    "CANCEL",
    "CAPTURE",
    "REFUND"
  ],
  "reason": "27533:0003:6\/2016",
  "cvvResult": "1",
  "avsResult": "7",
  "parentPspReference": null,
  "pspReference": "762895314225",
  "merchantReference": "119223.0",
  "merchantAccountCode": "WikimediaCOM",
  "currency": "USD",
  "amount": 10,
  "eventDate": "2016-01-25T17:07:36.862+01:00",
  "success": true,
  "propertiesExcludedFromExport": []
}
